[
  {
    "path": "posts/2022-01-02-net-offensive-holding/",
    "title": "NFL Net Offensive Holding Calls",
    "description": "A look at offensive holding calls by team and play type through Week 16.",
    "author": [
      {
        "name": "Casey Caprini",
        "url": {}
      }
    ],
    "date": "2022-01-02",
    "categories": [],
    "contents": "\r\nMotivating questions\r\nThrough the black-and-gold colored glasses of a Steelers fan, it seemed like offensive holding calls basically were not called in 2020 (I can’t watch as much of other games as I’d like).\r\nI had been wondering how much a lack of holding calls may have negatively impacted the 2020 Steelers defense.\r\nHow crippling is a holding call to a drive?\r\nWhich teams have taken the most offensive holding penalties?\r\nWhich teams have drawn the most offensive holding calls?\r\nWhich teams draw the most holds while committing the fewest (i.e., drawn - taken = net holds drawn)?\r\nRecently, Matt Williamson wondered aloud whether more holds occur on run or pass plays on an episode of SNR: The Drive.\r\nMethod\r\nUsing play-by-play data via nflfastR:\r\nThrow out punt and kickoffs\r\nCount all holds called, even if declined or offset by another penalty\r\nIf not directly identified as a pass or run in the data set, infer whether the play call was a pass or run using keywords in the play description.\r\nSacks were counted as “pass” play calls.\r\nScrambles were also counted as play calls.\r\n\r\nThis is just amateur stuff for fun. I’m probably classifying some play calls incorrectly. I did a quick cross-check of total holding calls for 2021 against this website, and the results were tracking (it looks like the website includes special teams holds, whereas I threw them out).\r\nResults for 2021, Through Week 16\r\nAffect on series conversion rates\r\nBen Baldwin periodically post team series conversion rates, where a series is a success if it generates a new set of downs or scores a TD. Here’s a recent example.\r\nTypical series conversion rates for an offense are in the neighborhood of 70 percent.\r\nWhen an offense commits a holding penalty, the series conversion rate drops to 42.4 percent in 2021.\r\nNet offensive hold ranks\r\n\r\nOffensive holds committed ranks\r\n\r\nDefense offensive holding calls drawn ranks\r\n\r\nOffensive holds by play call\r\nThrough Week 16, 46.6 percent of all Offensive Holds have occurred on run plays.\r\nConclusion\r\nThis was a quick, interesting exercise.\r\nAn offensive holding call really does hurt a drive as much as it seems.\r\nIn the future, it would be interesting to look at the topic in more detail. For example, more holds were called on run plays (~54 percent) than pass plays in 2020, the opposite of 2021. Is there a trend in officiating, change in play call mix, or just random variation?\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2022-01-02T17:24:12-05:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-12-26-analytics-debate-gaps/",
    "title": "Gaps in the Analytics Debate",
    "description": "A few non-curmudgeonly issues with the \"pro analytics\" camp.",
    "author": [
      {
        "name": "Casey Caprini",
        "url": {}
      }
    ],
    "date": "2021-12-27",
    "categories": [],
    "contents": "\r\nIssues with the “pro analytics” side of the analytics debate\r\nAs many have noted, Week 15 of the NFL helped bring the sport’s analytics debate to an unfortunate place.\r\nHere are a few non-curmudgeonly issues I have with some in the “pro-analytics” camp.\r\nCommunicating model estimates without uncertainty\r\nThe expected win probability advantage of decisions are communicated without any uncertainty. However, a ‘Kick FG’ vs. ‘Go’ 4th down analysis contains six estimated parameters.\r\n\r\nImplying expected value optimization is the only valid decision making paradigm\r\nFor environments where it is hard to anticipate every contingency, the expected value paradigm that dominates the NFL decision making discourse has legitimate alternatives. However, anyone who questions the “analytics experts” is frequently cast as being unsophisticated or unable to grasp “the math.”\r\nGary Klein’s Recognition-primed Decision model describes how experienced experts in many domains can reliably make high-quality, time-compressed decisions in a completely different manner.\r\nGerd Gigerenzer has offered a compelling defense of Gut Decisions in many domains, demonstrating where heuristics can be superior to optimization via complex algorithms/models.\r\n\r\n\r\nModel estimates without uncertainty\r\nLet’s look at an example. Just before the half in Week 15 against the KC Chiefs, Brandon Staley faced the following decision.\r\nLink: https://twitter.com/ben_bot_baldwin/status/1471673042371858433The “medium, go for it” recommendation is the result of an expected value calculation based on six estimated parameters.\r\nTwo “conversion rate” estimates\r\nFor example, P(Score TD | ‘Go for it’) = 60%.\r\n\r\nFour win probability estimates for the possible resulting game states\r\nFor example, P(Win | Failed ‘Kick FG’ attempt) = 53%.\r\n\r\nWhat happens if we propagate some uncertainty into the estimates that are inputs into the expected value calculation? (Like a less sophisticated cousin of this awesome Shiny app, only that also considers that the Win Probability model could also have small errors.)\r\nAssume FG estimate is very accurate (i.e., error N(0, 0.25%)).\r\nFor other parameters, assume estimates is within 5% margin of error (i.e., errors N(0, 2.5%)).\r\nAre errors of such magnitude sufficiently charitable to the model? For a toy exercise, I think so. That would seem like an excellent model to me! Sources of such errors could be attributable to injuries, weather, game plan, etc. that couldn’t be captured by a model.\r\n\r\n\r\n\r\nDistribution of Expected Win Probability Results with Random Error in Underlying ParametersWhat’s the point?\r\nSome use an expected win probability advantage of at least 1 WP as a threshold to judge when a decisions is “correct.” Assume we accept the expected value paradigm (i.e., ignore my second complaint at present).\r\nPropagating some modest uncertainty in the estimated parameters underlying the expected value calculation suggests that categorizing coaching quality based on agreement with a specific model may not be justified for decisions with relatively narrow margins.\r\nIn this simulation, 35.7 percent of the simulated expected value calculations fail to exceeded the 1 WP advantage threshold for the aggressive “Go for it” decision.\r\nI’m not suggesting I’ve done this optimally (or perhaps even acceptably) for this example, but I think it is important to express uncertainty with estimates. In the future, I hope the “pro analytics” side of the debate finds a way to communicate uncertainty with their estimates such that this is captured.\r\nExpected value optimization as only valid paradigm\r\nI highly recommend Gary Klein’s Sources of Power. Klein studied how individuals in complex domains (e.g., emergency responders, combatants) actually make decisions. The result was the (descriptive) Recognition-primed Decision (RPD) model.\r\nHere’s my rough summary of the findings relevant to NFL coaching decision discussion.\r\nContrary to prevailing wisdom, it is novice decision makers in many domains that make decisions by comparing the projected consequences of multiple alternative courses of action.\r\nExpert decision makers, in contrast, draw upon cues in the environment and recognize a high quality candidate solution using their prior experience.\r\nThis candidate solution is interrogated for potential problems via a (comparatively) simple mental simulation.\r\nField studies in these domains demonstrate this single-path analysis mode is an improvement over comparative analysis similar to the expected win probability analyses.\r\n\r\nHere’s a recent example of “expected value optimization is the only valid decision making paradigm” in the analytics debate.\r\nLink: https://twitter.com/benbbaldwin/status/1473012593547751424I see a lot of Klein’s descriptive model of expert “naturalistic decision making” from Coach Belichick, including critical reflection on previous decisions to learn like an expert. If I were a Pats fan, I’d be encouraged.\r\nWhat’s the point?\r\nCoaches are trying to find the most probable single trajectory to victory; the expected value of a strategy will not be realized for a single decision. Additionally, it is very plausible to me that an expert coach could identify valid reasons – unique to the specific game situation – why a an expected win probability model may not apply perfectly for the specific decision being made.\r\nThere is a lot of serious academic and other work that support the view that there are alternatives that can be superior to expected value optimization in some settings. Their discussion appears entirely absent from the slice of the analytics debate to which I am exposed.\r\nIf I were to anticipate criticisms, it would be something like the following: win probability models are now of sufficient quality that NFL games are now “smallish” enough words that no biased human expert can systematically be superior to the model. I’m skeptical.\r\nA few other book recommendations that explore alternatives to “rational” optimization in the applicable contexts:\r\nRadical Uncertainty, by John Kay and Mervyn King\r\nGut Feelings: The Intelligence of the Unconscious, by Gerd Gigerenzer\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-12-27T12:13:35-05:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-11-28-time-average-nfl-metrics/",
    "title": "Time Average Metrics for NFL Team Quality",
    "description": "An alternative to margin of victory that better reflects the path to the final result.",
    "author": [
      {
        "name": "Casey Caprini",
        "url": {}
      }
    ],
    "date": "2021-11-28",
    "categories": [],
    "contents": "\r\nRevised 12/22/2021 and 01/10/2022.\r\nWhat is a “time average lead”?\r\nThe time average point lead for a game is a coarse-grained metric that summarizes its overall competitiveness.\r\nLet’s consider a simple example. In Week 15 of the 2021 season, the New Orleans Saints went to Tampa Bay and upset the Bucs, winning 9-0.\r\nThis example is simple because there were only three scoring plays. Also, since the Bucs were shut out, the New Orleans score is equal to the New Orleans lead throughout the game. (If New Orleans had trailed at some point in the game, their “lead” would have been a negative number for that part of the game.)\r\nLet’s look at a plot of the Saints shutout.\r\n\r\n\r\n\r\n\r\nThe “time average lead” is just a weighted average of the team’s leads throughout the game, weighted by the fraction of the game they held each lead. Geometrically, it is the sum of the area under the “lead” curve, divided by 60 minutes played. The plot is annotated to show the areas of the three lead intervals and the time average lead for the game.\r\nWhy “time average” point differentials?\r\nA few notable features of time average lead as a point-estimate game summary:\r\nThe units of the metric is points, which is intuitive to football fans.\r\nFor better or worse, the value of the metric relies on the assumption that a time average is informative. Time averages are often informative for processes that are at least partially path-dependent. A time average is just an average and therefore has the advantage of not relying on other modeling assumptions.\r\nIf you’re curious, the 2021 NFL season time average results (and other derived metrics) can be found here.\r\nA few other concrete examples\r\nConsider two more complex games from Week 1 of 2021.\r\nPIT 23, BUF 16\r\nSF 41, DET 33\r\n\r\n\r\n\r\nThe margin of victory for the Steelers and the 49ers was very similar. However, the time average point differential is significantly different.\r\nTeam\r\nMargin of Victory\r\nTime Average Lead\r\nPIT\r\n7\r\n-2.1\r\nSF\r\n8\r\n13.3\r\nLet’s compare the Win Probability graph for the two games.\r\n\r\n\r\nDespite the similar margin of victory for both teams, the Win Probability graphs reflect very different paths to the result.\r\nThe Steelers surged to take control in the 4th quarter, fueled by a Bills turnover on downs near midfield and a Pittsburgh TD on a blocked punt.\r\nThe Lions never threatened the 49ers until it was too late. Detroit scored two TDs and converted two 2-point conversions after the 2-minute warning in the 4th quarter. On top of defensive lapses, the 49ers allowed a successful onside kick and fumbled while trying to kill clock.\r\nThe Steelers made big plays late to win a game they kept close, while the 49ers controlled the game until hilarity ensued inside of 2-minutes. The time average point differential better reflects the path these games took to the final outcome than the final margin of victory.\r\nRecent NFL seasons\r\nThe following shows the distribution of time average game results (from the home team’s perspective) for all regular season games in 2011 to 20202. \r\nAs expected,\r\nMost positive time average differentials result in wins, while most negative time average point differentials result in losses.\r\nThere is evidence of a home team advantage: on average, home teams lead by ~1.4 points at any given point in regulation time for the decade considered of regular season games considered.\r\nResources and sources of inspiration\r\nInspired by an Ole Peters talk on Ergodicity Economics, I decided to investigate time averages in NFL games. Like life, my prior is that a football game is path dependent. Game script matters. Play calling goals vary with game situation.\r\nAt the time, I was reading 2021 NFL season previews and retrospectives on the 2020 season. The hypothesis was this: because of path dependence, time averages might enable better retrospective assessment of regular season team quality than season point differential and other aggregate metrics (e.g., Pythagorean Win Expectation).\r\nI the most amateur of R users. This post contains adapted code and inspiration from:\r\nThe tidyverse.\r\nThe nflfastR of the nflverse.\r\nTom Mock’s excellent posts on plotting images and tables\r\nShannon Pileggi’s excellent blog post on creating your own R package.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2022-01-10T23:54:20-05:00",
    "input_file": "time-average-nfl-metrics.utf8.md"
  }
]
