[
  {
    "path": "posts/2021-11-28-time-average-nfl-metrics/",
    "title": "Time Average Metrics for NFL Team Quality",
    "description": "An average that better accounts for game script and discounts the backdoor cover.",
    "author": [
      {
        "name": "Casey Caprini",
        "url": {}
      }
    ],
    "date": "2021-11-28",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n2020 NFL Regular Season Time Average RankingsWhy “time average” point differentials?\r\nInspired by an Ole Peters talk on Ergodicity Economics, I investigated time averages in NFL games. Like life, my prior is that a football game is path dependent. Game script matters. Play calling goals vary with game situation.\r\nAt the time, I was reading 2021 NFL season previews and retrospectives on the 2020 season. The hypothesis was this: because of path dependence, time averages might be enable better retrospective assessment of regular season team quality than season point differential and other aggregate metrics (e.g., Pythagorean Win Expectation).\r\nA few other notes:\r\nThe units of the metric is points, which is intuitive to football fans.\r\nFor better or worse, the value of the metric relies on the assumption that a time average is informative. However, it does not rely on modeling assumptions.\r\nIf your curious, the current NFL season to date results (with an adjustment for opponent quality) can be found linked on the top navigation bar.\r\nA few concrete example games\r\nConsider the win probability graphs for two games in Week 1 of 2021.\r\nPIT 23, BUF 16\r\nSF 41, DET 33\r\n\r\n\r\n\r\n\r\n\r\nDespite the similar margin of victory for both teams, the Win Probability graphs reflect very different paths to the result.\r\nThe Steelers surged to take control in the 4th quarter, fueled by a Bills turnover on downs near midfield and a Pittsburgh TD on a blocked punt.\r\nThe Lions never threatened the 49ers until it was too late. Detroit scored two TDs and converted two 2-point conversions after the 2-minute warning in the 4th quarter. On top of defensive lapses, the 49ers allowed a successful onside kick and fumbled while trying to kill clock.\r\nThe time average point differential for a game is a coarse-grained metric summarizing its overall competitiveness: the Steelers made big plays late to win a close game, while the 49ers controlled the game until hilarity ensued inside of 2-minutes.\r\nTeam\r\nMargin of Victory\r\nTime Average Point Diff\r\nPIT\r\n7\r\n-2.1\r\nSF\r\n8\r\n13.3\r\nRecent NFL seasons\r\nThe following shows the distribution of time average game results (from the home team’s perspective) for all regular season games in 2011 to 20202. \r\nAs expected,\r\nMost positive time average differentials result in wins, while most negative time average point differentials result in losses.\r\nThere is evidence of a home team advantage: on average, home teams lead by ~1.4 points at any given point in regulation time for the decade considered of regular season games considered.\r\nResources and sources of inspiration\r\nI the most amateur of R users. This post contains adapted code and inspiration from:\r\nTom Mock’s excellent posts on plotting images and tables\r\nShannon Pileggi’s excellent blog post on creating your own R package.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-12-07T23:06:50-05:00",
    "input_file": {}
  }
]
